web/TUBES/Pemerintahan/pemerintahan/app/Controllers/Home.php

SELECT *
FROM `penyuluhan`
---
    public function index()
    {
        $data['active_page'] = 'penyuluhan';
        $data['username'] = 'admin';
        $data['role'] = 'admin';
        $data['penyuluhan'] = $this->penyuluhanModel->findAll();

INSERT INTO `penyuluhan` (`nama_penyuluhan`, `tanggal_pelaksanaan`, `no_sk`, `surat_kinerja`) VALUES ('naem', '2023-12-30', '123', 'uploads/penyuluhan/1703902523_4473094377288383b404.pdf')
---
    public function createPenyuluhan()
    {
        if ($this->request->getMethod() === 'post') {
            $data = $this->request->getPost();
            $file = $this->request->getFile('surat_kinerja');

            if ($file->isValid() && !$file->hasMoved()) {
                // Mengubah path ke direktori public
                $folderPath = FCPATH . 'uploads/penyuluhan';
                if (!is_dir($folderPath)) {
                    mkdir($folderPath, 0777, true);
                }

                $fileName = $file->getRandomName();
                $file->move($folderPath, $fileName);
                $data['surat_kinerja'] = 'uploads/penyuluhan/' . $fileName;
            }

            if ($this->penyuluhanModel->save($data)) {